app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aa"], ["content", "$2a$12$HfMCIY8U/tMOWxwTni0nwekDciDyJ.Qn/HS0DEk.xmZk3ZbuyquLO"], ["created_at", "2023-04-28 05:26:25.060567"], ["updated_at", "2023-04-28 05:26:25.060567"]]
---
  def create
	  Post.create(title: params[:title], content: params[:content])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "aa"], ["updated_at", "2023-04-28 09:27:59.659373"], ["id", 9]]
---
  def update
	 #require './lib/my_service'

	  @post = Post.find(params[:id])

	  ca_cert = File.open("/workspace/certificate.crt")
	  vault = Services::VaultWrapper.new("https://vault.idtplateer.com", ca_cert)
	  vault.token_auth("hvs.BzgsMs2VqA0RBn8feu1zdDgL")

	  #key_name = "my-transit-key"
	  #key_type = "rsa-2048"
	  #vault.create_transit_key(key_name, key_type)

	  #vault = Vault::Client.new(address: "https://vault.idtplateer.com", token: "hvs.BzgsMs2VqA0RBn8feu1zdDgL", ssl_verify: false)
	  #vstatus = vault.sys.seal_status
	  #wrapped = vault.auth_token.create(wrap_ttl: "100s")
	  #unwrapped = vault.logical.unwrap(wrapped.wrap_info.token)
	  #token = unwrapped.data.auth.client_token

	  @post.update(title: params[:title], content: "aa")

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
---
  def destroy
	  Post.destroy(params[:id])